---
custom_edit_url: https://github.com/langchain-ai/langchain/edit/master/docs/docs/how_to/graph_prompting.ipynb
description: ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ ì¿¼ë¦¬ ìƒì„±ì„ ê°œì„ í•˜ê¸° ìœ„í•œ í”„ë¡¬í”„íŠ¸ ì „ëµê³¼ Neo4j ë°ì´í„°ë² ì´ìŠ¤ ì„¤ì • ë°©ë²•ì„ ì•ˆë‚´í•˜ëŠ” ê°€ì´ë“œì…ë‹ˆë‹¤.
sidebar_position: 2
---

# ê·¸ë˜í”„-RAGì— ëŒ€í•œ ìµœì ì˜ í”„ë¡¬í”„íŠ¸ ë°©ë²•

ì´ ê°€ì´ë“œì—ì„œëŠ” ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ ì¿¼ë¦¬ ìƒì„±ì„ ê°œì„ í•˜ê¸° ìœ„í•œ í”„ë¡¬í”„íŠ¸ ì „ëµì— ëŒ€í•´ ì„¤ëª…í•©ë‹ˆë‹¤. ìš°ë¦¬ëŠ” ì£¼ë¡œ í”„ë¡¬í”„íŠ¸ì—ì„œ ê´€ë ¨ ë°ì´í„°ë² ì´ìŠ¤ íŠ¹ì • ì •ë³´ë¥¼ ì–»ëŠ” ë°©ë²•ì— ì§‘ì¤‘í•  ê²ƒì…ë‹ˆë‹¤.

## ì„¤ì •

ë¨¼ì €, í•„ìš”í•œ íŒ¨í‚¤ì§€ë¥¼ ê°€ì ¸ì˜¤ê³  í™˜ê²½ ë³€ìˆ˜ë¥¼ ì„¤ì •í•©ë‹ˆë‹¤:

```python
%pip install --upgrade --quiet  langchain langchain-community langchain-openai neo4j
```

```output
Note: you may need to restart the kernel to use updated packages.
```

ì´ ê°€ì´ë“œì—ì„œëŠ” OpenAI ëª¨ë¸ì„ ê¸°ë³¸ìœ¼ë¡œ ì‚¬ìš©í•˜ì§€ë§Œ, ì›í•˜ëŠ” ëª¨ë¸ ì œê³µìë¡œ êµì²´í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
import getpass
import os

os.environ["OPENAI_API_KEY"] = getpass.getpass()

# Uncomment the below to use LangSmith. Not required.
# os.environ["LANGCHAIN_API_KEY"] = getpass.getpass()
# os.environ["LANGCHAIN_TRACING_V2"] = "true"
```

```output
 Â·Â·Â·Â·Â·Â·Â·Â·
```

ë‹¤ìŒìœ¼ë¡œ, Neo4j ìê²© ì¦ëª…ì„ ì •ì˜í•´ì•¼ í•©ë‹ˆë‹¤.
[ì´ ì„¤ì¹˜ ë‹¨ê³„](https://neo4j.com/docs/operations-manual/current/installation/)ë¥¼ ë”°ë¼ Neo4j ë°ì´í„°ë² ì´ìŠ¤ë¥¼ ì„¤ì •í•˜ì„¸ìš”.

```python
os.environ["NEO4J_URI"] = "bolt://localhost:7687"
os.environ["NEO4J_USERNAME"] = "neo4j"
os.environ["NEO4J_PASSWORD"] = "password"
```


ì•„ë˜ ì˜ˆì œëŠ” Neo4j ë°ì´í„°ë² ì´ìŠ¤ì™€ ì—°ê²°ì„ ìƒì„±í•˜ê³  ì˜í™” ë° ê·¸ ë°°ìš°ì— ëŒ€í•œ ì˜ˆì œ ë°ì´í„°ë¡œ ì±„ì›ë‹ˆë‹¤.

```python
<!--IMPORTS:[{"imported": "Neo4jGraph", "source": "langchain_community.graphs", "docs": "https://api.python.langchain.com/en/latest/graphs/langchain_community.graphs.neo4j_graph.Neo4jGraph.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain_community.graphs import Neo4jGraph

graph = Neo4jGraph()

# Import movie information

movies_query = """
LOAD CSV WITH HEADERS FROM 
'https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/movies/movies_small.csv'
AS row
MERGE (m:Movie {id:row.movieId})
SET m.released = date(row.released),
    m.title = row.title,
    m.imdbRating = toFloat(row.imdbRating)
FOREACH (director in split(row.director, '|') | 
    MERGE (p:Person {name:trim(director)})
    MERGE (p)-[:DIRECTED]->(m))
FOREACH (actor in split(row.actors, '|') | 
    MERGE (p:Person {name:trim(actor)})
    MERGE (p)-[:ACTED_IN]->(m))
FOREACH (genre in split(row.genres, '|') | 
    MERGE (g:Genre {name:trim(genre)})
    MERGE (m)-[:IN_GENRE]->(g))
"""

graph.query(movies_query)
```


```output
[]
```


# ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆ í•„í„°ë§

ë•Œë•Œë¡œ Cypher ë¬¸ì„ ìƒì„±í•  ë•Œ ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆì˜ íŠ¹ì • í•˜ìœ„ ì§‘í•©ì— ì§‘ì¤‘í•´ì•¼ í•  í•„ìš”ê°€ ìˆìŠµë‹ˆë‹¤.
ë‹¤ìŒ ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆë¥¼ ë‹¤ë£¬ë‹¤ê³  ê°€ì •í•´ ë³´ê² ìŠµë‹ˆë‹¤:

```python
graph.refresh_schema()
print(graph.schema)
```

```output
Node properties are the following:
Movie {imdbRating: FLOAT, id: STRING, released: DATE, title: STRING},Person {name: STRING},Genre {name: STRING}
Relationship properties are the following:

The relationships are the following:
(:Movie)-[:IN_GENRE]->(:Genre),(:Person)-[:DIRECTED]->(:Movie),(:Person)-[:ACTED_IN]->(:Movie)
```

*ì¥ë¥´* ë…¸ë“œë¥¼ LLMì— ì „ë‹¬í•˜ëŠ” ìŠ¤í‚¤ë§ˆ í‘œí˜„ì—ì„œ ì œì™¸í•˜ê³  ì‹¶ë‹¤ê³  ê°€ì •í•´ ë³´ê² ìŠµë‹ˆë‹¤.
GraphCypherQAChain ì²´ì¸ì˜ `exclude` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ì´ë¥¼ ë‹¬ì„±í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
<!--IMPORTS:[{"imported": "GraphCypherQAChain", "source": "langchain.chains", "docs": "https://api.python.langchain.com/en/latest/chains/langchain_community.chains.graph_qa.cypher.GraphCypherQAChain.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "ChatOpenAI", "source": "langchain_openai", "docs": "https://api.python.langchain.com/en/latest/chat_models/langchain_openai.chat_models.base.ChatOpenAI.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain.chains import GraphCypherQAChain
from langchain_openai import ChatOpenAI

llm = ChatOpenAI(model="gpt-3.5-turbo", temperature=0)
chain = GraphCypherQAChain.from_llm(
    graph=graph, llm=llm, exclude_types=["Genre"], verbose=True
)
```


```python
print(chain.graph_schema)
```

```output
Node properties are the following:
Movie {imdbRating: FLOAT, id: STRING, released: DATE, title: STRING},Person {name: STRING}
Relationship properties are the following:

The relationships are the following:
(:Person)-[:DIRECTED]->(:Movie),(:Person)-[:ACTED_IN]->(:Movie)
```

## ëª‡ ê°€ì§€ ìƒ· ì˜ˆì œ

í”„ë¡¬í”„íŠ¸ì— ìì—°ì–´ ì§ˆë¬¸ì´ ë°ì´í„°ë² ì´ìŠ¤ì— ëŒ€í•œ ìœ íš¨í•œ Cypher ì¿¼ë¦¬ë¡œ ë³€í™˜ë˜ëŠ” ì˜ˆì œë¥¼ í¬í•¨í•˜ë©´ ëª¨ë¸ ì„±ëŠ¥ì´ í–¥ìƒë˜ëŠ” ê²½ìš°ê°€ ë§ìŠµë‹ˆë‹¤. íŠ¹íˆ ë³µì¡í•œ ì¿¼ë¦¬ì˜ ê²½ìš° ë”ìš± ê·¸ë ‡ìŠµë‹ˆë‹¤.

ë‹¤ìŒê³¼ ê°™ì€ ì˜ˆì œê°€ ìˆë‹¤ê³  ê°€ì •í•´ ë³´ê² ìŠµë‹ˆë‹¤:

```python
examples = [
    {
        "question": "How many artists are there?",
        "query": "MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)",
    },
    {
        "question": "Which actors played in the movie Casino?",
        "query": "MATCH (m:Movie {{title: 'Casino'}})<-[:ACTED_IN]-(a) RETURN a.name",
    },
    {
        "question": "How many movies has Tom Hanks acted in?",
        "query": "MATCH (a:Person {{name: 'Tom Hanks'}})-[:ACTED_IN]->(m:Movie) RETURN count(m)",
    },
    {
        "question": "List all the genres of the movie Schindler's List",
        "query": "MATCH (m:Movie {{title: 'Schindler\\'s List'}})-[:IN_GENRE]->(g:Genre) RETURN g.name",
    },
    {
        "question": "Which actors have worked in movies from both the comedy and action genres?",
        "query": "MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name",
    },
    {
        "question": "Which directors have made movies with at least three different actors named 'John'?",
        "query": "MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name",
    },
    {
        "question": "Identify movies where directors also played a role in the film.",
        "query": "MATCH (p:Person)-[:DIRECTED]->(m:Movie), (p)-[:ACTED_IN]->(m) RETURN m.title, p.name",
    },
    {
        "question": "Find the actor with the highest number of movies in the database.",
        "query": "MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1",
    },
]
```


ì´ë“¤ì„ ì‚¬ìš©í•˜ì—¬ ëª‡ ê°€ì§€ ìƒ· í”„ë¡¬í”„íŠ¸ë¥¼ ë‹¤ìŒê³¼ ê°™ì´ ë§Œë“¤ ìˆ˜ ìˆìŠµë‹ˆë‹¤:

```python
<!--IMPORTS:[{"imported": "FewShotPromptTemplate", "source": "langchain_core.prompts", "docs": "https://api.python.langchain.com/en/latest/prompts/langchain_core.prompts.few_shot.FewShotPromptTemplate.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "PromptTemplate", "source": "langchain_core.prompts", "docs": "https://api.python.langchain.com/en/latest/prompts/langchain_core.prompts.prompt.PromptTemplate.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate

example_prompt = PromptTemplate.from_template(
    "User input: {question}\nCypher query: {query}"
)
prompt = FewShotPromptTemplate(
    examples=examples[:5],
    example_prompt=example_prompt,
    prefix="You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n\nHere is the schema information\n{schema}.\n\nBelow are a number of examples of questions and their corresponding Cypher queries.",
    suffix="User input: {question}\nCypher query: ",
    input_variables=["question", "schema"],
)
```


```python
print(prompt.format(question="How many artists are there?", schema="foo"))
```

```output
You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.

Here is the schema information
foo.

Below are a number of examples of questions and their corresponding Cypher queries.

User input: How many artists are there?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)

User input: Which actors played in the movie Casino?
Cypher query: MATCH (m:Movie {title: 'Casino'})<-[:ACTED_IN]-(a) RETURN a.name

User input: How many movies has Tom Hanks acted in?
Cypher query: MATCH (a:Person {name: 'Tom Hanks'})-[:ACTED_IN]->(m:Movie) RETURN count(m)

User input: List all the genres of the movie Schindler's List
Cypher query: MATCH (m:Movie {title: 'Schindler\'s List'})-[:IN_GENRE]->(g:Genre) RETURN g.name

User input: Which actors have worked in movies from both the comedy and action genres?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name

User input: How many artists are there?
Cypher query:
```

## ë™ì  ëª‡ ê°€ì§€ ìƒ· ì˜ˆì œ

ì¶©ë¶„í•œ ì˜ˆì œê°€ ìˆë‹¤ë©´, ëª¨ë¸ì˜ ì»¨í…ìŠ¤íŠ¸ ì°½ì— ë§ì§€ ì•Šê±°ë‚˜ ê¸´ ì˜ˆì œ ëª©ë¡ì´ ëª¨ë¸ì„ ë°©í•´í•˜ê¸° ë•Œë¬¸ì— ê°€ì¥ ê´€ë ¨ì„±ì´ ë†’ì€ ì˜ˆì œë§Œ í”„ë¡¬í”„íŠ¸ì— í¬í•¨í•˜ê³  ì‹¶ì„ ìˆ˜ ìˆìŠµë‹ˆë‹¤. íŠ¹íˆ, ì£¼ì–´ì§„ ì…ë ¥ì— ëŒ€í•´ ê°€ì¥ ê´€ë ¨ì„±ì´ ë†’ì€ ì˜ˆì œë¥¼ í¬í•¨í•˜ê³  ì‹¶ìŠµë‹ˆë‹¤.

ìš°ë¦¬ëŠ” ExampleSelectorë¥¼ ì‚¬ìš©í•˜ì—¬ ì´ë¥¼ ìˆ˜í–‰í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤. ì´ ê²½ìš° [SemanticSimilarityExampleSelector](https://api.python.langchain.com/en/latest/example_selectors/langchain_core.example_selectors.semantic_similarity.SemanticSimilarityExampleSelector.html)ë¥¼ ì‚¬ìš©í•˜ì—¬ ì„ íƒí•œ ë²¡í„° ë°ì´í„°ë² ì´ìŠ¤ì— ì˜ˆì œë¥¼ ì €ì¥í•©ë‹ˆë‹¤. ëŸ°íƒ€ì„ì— ì…ë ¥ê³¼ ì˜ˆì œ ê°„ì˜ ìœ ì‚¬ì„± ê²€ìƒ‰ì„ ìˆ˜í–‰í•˜ê³  ê°€ì¥ ì˜ë¯¸ì ìœ¼ë¡œ ìœ ì‚¬í•œ ì˜ˆì œë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤:

```python
<!--IMPORTS:[{"imported": "Neo4jVector", "source": "langchain_community.vectorstores", "docs": "https://api.python.langchain.com/en/latest/vectorstores/langchain_community.vectorstores.neo4j_vector.Neo4jVector.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "SemanticSimilarityExampleSelector", "source": "langchain_core.example_selectors", "docs": "https://api.python.langchain.com/en/latest/example_selectors/langchain_core.example_selectors.semantic_similarity.SemanticSimilarityExampleSelector.html", "title": "How to best prompt for Graph-RAG"}, {"imported": "OpenAIEmbeddings", "source": "langchain_openai", "docs": "https://api.python.langchain.com/en/latest/embeddings/langchain_openai.embeddings.base.OpenAIEmbeddings.html", "title": "How to best prompt for Graph-RAG"}]-->
from langchain_community.vectorstores import Neo4jVector
from langchain_core.example_selectors import SemanticSimilarityExampleSelector
from langchain_openai import OpenAIEmbeddings

example_selector = SemanticSimilarityExampleSelector.from_examples(
    examples,
    OpenAIEmbeddings(),
    Neo4jVector,
    k=5,
    input_keys=["question"],
)
```


```python
example_selector.select_examples({"question": "how many artists are there?"})
```


```output
[{'query': 'MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)',
  'question': 'How many artists are there?'},
 {'query': "MATCH (a:Person {{name: 'Tom Hanks'}})-[:ACTED_IN]->(m:Movie) RETURN count(m)",
  'question': 'How many movies has Tom Hanks acted in?'},
 {'query': "MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name",
  'question': 'Which actors have worked in movies from both the comedy and action genres?'},
 {'query': "MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name",
  'question': "Which directors have made movies with at least three different actors named 'John'?"},
 {'query': 'MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1',
  'question': 'Find the actor with the highest number of movies in the database.'}]
```


ì‚¬ìš©í•˜ë ¤ë©´, ExampleSelectorë¥¼ ì§ì ‘ FewShotPromptTemplateì— ì „ë‹¬í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤:

```python
prompt = FewShotPromptTemplate(
    example_selector=example_selector,
    example_prompt=example_prompt,
    prefix="You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n\nHere is the schema information\n{schema}.\n\nBelow are a number of examples of questions and their corresponding Cypher queries.",
    suffix="User input: {question}\nCypher query: ",
    input_variables=["question", "schema"],
)
```


```python
print(prompt.format(question="how many artists are there?", schema="foo"))
```

```output
You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.

Here is the schema information
foo.

Below are a number of examples of questions and their corresponding Cypher queries.

User input: How many artists are there?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)

User input: How many movies has Tom Hanks acted in?
Cypher query: MATCH (a:Person {name: 'Tom Hanks'})-[:ACTED_IN]->(m:Movie) RETURN count(m)

User input: Which actors have worked in movies from both the comedy and action genres?
Cypher query: MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name

User input: Which directors have made movies with at least three different actors named 'John'?
Cypher query: MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name

User input: Find the actor with the highest number of movies in the database.
Cypher query: MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1

User input: how many artists are there?
Cypher query:
```


```python
llm = ChatOpenAI(model="gpt-3.5-turbo", temperature=0)
chain = GraphCypherQAChain.from_llm(
    graph=graph, llm=llm, cypher_prompt=prompt, verbose=True
)
```


```python
chain.invoke("How many actors are in the graph?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)[0m
Full Context:
[32;1m[1;3m[{'count(DISTINCT a)': 967}][0m

[1m> Finished chain.[0m
```


```output
{'query': 'How many actors are in the graph?',
 'result': 'There are 967 actors in the graph.'}
```